# weekdays = ["понедельник", "вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"]
# # week = []
# # for i in weekdays:
#     # i = i.upper()
# weekdays.append("5")
# print(weekdays)
##############Задача 1#################################################
"""Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
Выведите все элементы, которые меньше 5."""

my_list = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
my_l = []
for i in my_list:
    if i < 5:
        my_l.append(i)
print("Первый вариант решения: ", my_l)
print("Второй вариант решения: ", list(filter(lambda x: x<5, my_list)))
print("Третий вариант решения: ", list(x for x in my_list if x < 5))
##########################################################################
##############Задача 2####################################################

"""Даны списки:
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
Нужно вернуть список, который состоит из элементов, общих для этих двух списков."""

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
res = list(filter(lambda x: x in a, b))
res1 = list(x for x in b if x in a)
print(res)
print(res1)